{
  "Skills": {
	"ag_1": {
	  "name": "Agriculture Upgrade I",
	  "description": "Basic crop rotation techniques improve soil health and boost crop output by 10%."
	},
	"ag_2": {
	  "name": "Agriculture Upgrade II",
	  "description": "Advanced seeding methods increase planting efficiency and expand harvestable land. Crop output rises by 15%."
	},
	"ag_3": {
	  "name": "Agriculture Upgrade III",
	  "description": "Enhanced fertilization and pest control reduce crop loss and accelerate growth cycles. Crop output increases by 20%."
	},
	"ag_4": {
	  "name": "Agriculture Upgrade IV",
	  "description": "Mechanized farming equipment significantly improves large-scale planting and harvesting efficiency. Crop output increases by 25%."
	},
	"ag_5": {
	  "name": "Agriculture Upgrade V",
	  "description": "Genetically optimized crops and precision agriculture maximize yields and resource use. Crop output is boosted by 30%."
	},
	"in_1": {
	  "name": "Industry Upgrade I",
	  "description": "Basic manufacturing techniques improve production speed and reduce material waste by 5%."
	},
	"in_2": {
	  "name": "Industry Upgrade II",
	  "description": "Introduction of assembly line processes increases factory efficiency. Production output rises by 10%."
	},
	"in_3": {
	  "name": "Industry Upgrade III",
	  "description": "Automation and robotics reduce labor costs and speed up manufacturing. Production output increases by 15%."
	},
	"in_4": {
	  "name": "Industry Upgrade IV",
	  "description": "Advanced supply chain management optimizes resource flow and minimizes downtime. Production output rises by 20%."
	},
	"in_5": {
	  "name": "Industry Upgrade V",
	  "description": "Cutting-edge smart factories integrate AI-driven optimization, maximizing industrial efficiency. Production output increases by 25%."
	},
	"en_1": {
	  "name": "Environment Upgrade I",
	  "description": "Basic conservation practices reduce pollution and improve land sustainability by 5%."
	},
	"en_2": {
	  "name": "Environment Upgrade II",
	  "description": "Introduction of renewable energy sources decreases reliance on fossil fuels. Environmental impact reduced by 10%."
	},
	"en_3": {
	  "name": "Environment Upgrade III",
	  "description": "Advanced recycling and waste management systems minimize resource waste. Environmental impact reduced by 15%."
	},
	"en_4": {
	  "name": "Environment Upgrade IV",
	  "description": "Widespread reforestation and habitat restoration programs improve biodiversity. Environmental impact reduced by 20%."
	},
	"en_5": {
	  "name": "Environment Upgrade V",
	  "description": "Sustainable infrastructure and closed-loop systems ensure long-term environmental balance. Environmental impact reduced by 25%."
	},
	"te_1": {
	  "name": "Technology Upgrade I",
	  "description": "Basic research facilities improve innovation speed and unlock simple technological advancements."
	},
	"te_2": {
	  "name": "Technology Upgrade II",
	  "description": "Computing advancements accelerate research and enable complex data analysis. Research output increases by 10%."
	},
	"te_3": {
	  "name": "Technology Upgrade III",
	  "description": "Advanced materials and electronics open new engineering possibilities. Research and production efficiency rise by 15%."
	},
	"te_4": {
	  "name": "Technology Upgrade IV",
	  "description": "Artificial intelligence and machine learning revolutionize design and discovery. Research output increases by 20%."
	},
	"te_5": {
	  "name": "Technology Upgrade V",
	  "description": "Breakthrough innovations in nanotechnology and quantum computing redefine technological capabilities. Research output increases by 25%."
	}
  }
}
